[
  {
    "Spell Name": "Vital Harvest",
    "Description": "This spell allows the mage to draw and manipulate life force from living organisms. They can siphon vitality from plants, animals, or even willing individuals to replenish their own energy or heal wounds.",
    "Practice": "Making"
  },
  {
    "Spell Name": "Nourishing Radiance",
    "Description": "The mage invokes this spell to emanate a gentle, healing aura. It promotes physical well-being and accelerates natural healing processes in themselves and others within its vicinity.",
    "Practice": "Perfecting"
  },
  {
    "Spell Name": "Decay's Embrace",
    "Description": "By tapping into the cycle of decay and renewal, the mage can accelerate the natural decomposition of organic matter. This spell hastens the breakdown of substances, causing them to rot and deteriorate rapidly.",
    "Practice": "Unmaking"
  },
  {
    "Spell Name": "Harmonious Growth",
    "Description": "This spell nurtures and accelerates the growth of plants, stimulating their development and enhancing their vitality. It can be used to cultivate bountiful crops, heal damaged vegetation, or accelerate the growth of specific plants.",
    "Practice": "Weaving"
  },
  {
    "Spell Name": "Preservation Ward",
    "Description": "The mage creates a protective barrier that shields objects or living beings from decay, deterioration, or spoilage. This spell slows down the effects of time, preserving the integrity and freshness of the protected target.",
    "Practice": "Shielding"
  },
  {
    "Spell Name": "Sustenance Siphon",
    "Description": "By channeling the essence of nourishment, the mage can drain sustenance from edible materials or consume it directly from living organisms. This spell allows them to sustain themselves without the need for conventional food sources.",
    "Practice": "Compelling"
  },
  {
    "Spell Name": "Essence Detection",
    "Description": "This spell heightens the mage's senses to perceive and analyze the vital energy within their surroundings. It enables them to detect life force, health conditions, or energetic imbalances in living beings or organic materials.",
    "Practice": "Knowing"
  },
  {
    "Spell Name": "Verdant Bloom",
    "Description": "By infusing an area with a surge of life energy, the mage triggers the rapid growth and blossoming of plants. This spell can turn barren landscapes into lush gardens or revitalize withered vegetation.",
    "Practice": "Patterning"
  },
  {
    "Spell Name": "Illusion of Abundance",
    "Description": "This spell creates an illusion of plenty, deceiving the senses and making a target perceive their surroundings as abundant with food, water, or resources. It can alleviate hunger or thirst temporarily.",
    "Practice": "Veiling"
  },
  {
    "Spell Name": "Restorative Brew",
    "Description": "By combining natural ingredients and invoking the power of Atrax, the mage brews a potent concoction that promotes healing and restores vitality. This spell is often used to create medicinal potions or elixirs.",
    "Practice": "Making"
  }]