[
  {
    "Spell Name": "Gravitic Manipulation",
    "Description": "This spell allows the mage to control and manipulate the force of gravity in their vicinity. They can increase or decrease gravitational pull, levitate objects or individuals, or create localized gravity wells.",
    "Practice": "Ruling"
  },
  {
    "Spell Name": "Binding Chains",
    "Description": "By invoking the oppressive nature of Axiôphêth, the mage can conjure ethereal chains that bind and restrict their target. These chains can immobilize, restrain, or suppress the movements and abilities of the affected individual.",
    "Practice": "Compelling"
  },
  {
    "Spell Name": "Weight of Burden",
    "Description": "This spell imposes a heavy burden on the target, both physically and metaphorically. It increases the weight they bear, making movement difficult and draining their energy and resolve.",
    "Practice": "Fraying"
  },
  {
    "Spell Name": "Density Shift",
    "Description": "The mage can alter the density and mass of objects or individuals through this spell. They can make something as light as a feather or as heavy as a boulder, manipulating the forces that hold matter together.",
    "Practice": "Making"
  },
  {
    "Spell Name": "Anchoring Barrier",
    "Description": "By creating an impenetrable barrier infused with the weight of Axiôphêth, the mage can shield an area or individual from external influences. This barrier repels physical, magical, or spiritual intrusions, providing a sense of security and stability.",
    "Practice": "Shielding"
  },
  {
    "Spell Name": "Oppression's Veil",
    "Description": "This spell allows the mage to cloak themselves or others in an aura of oppression, making them appear subservient and unremarkable. It grants them the ability to navigate oppressive environments unnoticed or blend in with oppressed individuals.",
    "Practice": "Veiling"
  },
  {
    "Spell Name": "Gravitational Pulse",
    "Description": "The mage generates a powerful surge of gravitational force that emanates from their location. It creates a shockwave that knocks back or immobilizes nearby objects or individuals, disrupting their balance and stability.",
    "Practice": "Unraveling"
  },
  {
    "Spell Name": "Gravity Well",
    "Description": "By concentrating the force of gravity in a specific area, the mage can create a localized gravity well. Objects or individuals within the well experience increased weight and find it difficult to escape its influence.",
    "Practice": "Patterning"
  },
  {
    "Spell Name": "Mass Transference",
    "Description": "This spell allows the mage to transfer mass from one object or individual to another. They can make one target heavier while making another lighter, redistributing weight and altering the balance of forces.",
    "Practice": "Weaving"
  },
  {
    "Spell Name": "Lead's Embrace",
    "Description": "By channeling the essence of lead, the mage creates a protective aura that shields them from external influences. It offers resistance against mental manipulation, magical intrusion, and other forms of oppressive forces.",
    "Practice": "Shielding"
  }]