[
  {
    "Spell Name": "Terraform",
    "Description": "This spell allows the mage to reshape the physical landscape, manipulating the earth, soil, and rock. They can create hills, dig trenches, or even reshape mountains to their will.",
    "Practice": "Patterning"
  },
  {
    "Spell Name": "Stone Armor",
    "Description": "By drawing upon the influence of Ieropaêl, the mage can create a protective armor made of solid rock. This spell forms a layer of sturdy stone around the target, providing enhanced defense against physical attacks.",
    "Practice": "Shielding"
  },
  {
    "Spell Name": "Earthquake",
    "Description": "This spell taps into the elemental power of the earth, causing the ground to tremble and shake violently. It creates seismic disturbances, toppling structures and disorienting those in the affected area.",
    "Practice": "Unmaking"
  },
  {
    "Spell Name": "Gaia's Blessing",
    "Description": "By channeling the essence of earth and soil, the mage can enhance the fertility and vitality of plants and crops. This spell accelerates their growth, strengthens their resilience, and increases their yield.",
    "Practice": "Making"
  },
  {
    "Spell Name": "Burrow",
    "Description": "This spell allows the mage to create tunnels or burrows within the earth, granting them or others the ability to travel underground swiftly and undetected. It provides a means of covert transportation or hiding.",
    "Practice": "Veiling"
  },
  {
    "Spell Name": "Petrify",
    "Description": "By harnessing the power of Ieropaêl, the mage can temporarily transform a target into solid stone. This spell immobilizes the individual, rendering them completely inert for a limited duration.",
    "Practice": "Ruling"
  },
  {
    "Spell Name": "Tremor Sense",
    "Description": "This spell heightens the mage's perception of vibrations and movements in the earth. It allows them to sense the presence and location of creatures or objects that are in contact with the ground.",
    "Practice": "Knowing"
  },
  {
    "Spell Name": "Stone Shape",
    "Description": "By manipulating the malleability of rock and stone, the mage can sculpt or reshape solid structures. This spell allows them to carve intricate designs, create statues, or modify existing stone formations.",
    "Practice": "Shaping"
  },
  {
    "Spell Name": "Earth's Embrace",
    "Description": "This spell enables the mage to merge with the earth, becoming one with the soil and rock. They can pass through solid ground, travel underground, or emerge from the earth at a different location.",
    "Practice": "Weaving"
  },
  {
    "Spell Name": "Rockslide",
    "Description": "By calling upon the power of Ieropaêl, the mage can trigger a cascading rockslide or landslide. This spell dislodges rocks and boulders, sending them tumbling down slopes and creating a hazardous terrain for others.",
    "Practice": "Unraveling"
  }]